LocationOptions = [
    '一教', '二教', '三教', '四教', '五教', '六教',
    '建筑馆', '东阶梯教室', '理科楼', '新水利馆', '旧经管报告厅',
    '技术科学楼', '主楼开放实验室', '逸夫图书馆', '西阶梯教室',
    '工物馆', '旧水利馆', '文北楼', '明理楼', '清华学堂',
    '蒙民伟楼(艺教)', '主楼', '舜德/经管西楼', '李兆基科技大楼',
    '文南楼', '何添楼', '自强科技楼', '蒙民伟科技', '建华/经管新楼',
    '微电子楼', '物理楼', '人文楼', '罗姆楼', '法律图书馆'
]

day2num = {
    '星期一': 1,
    '星期二': 2,
    '星期三': 3,
    '星期四': 4,
    '星期五': 5,
    '星期六': 6,
    '星期日': 7,
}

section2num = {
    '第1节': 1,
    '第2节': 2,
    '第3节': 3,
    '第4节': 4,
    '第5节': 5,
    '第6节': 6
}

nearby_time = [
    [1, 2], [3, 4], [4, 5], [2, 1], [4, 3], [5, 4]
]

num2day = {
    1: '星期一',
    2: '星期二',
    3: '星期三',
    4: '星期四',
    5: '星期五',
    6: '星期六',
    7: '星期日'
}

num2section = {
    1: '第1节',
    2: '第2节',
    3: '第3节',
    4: '第4节',
    5: '第5节',
    6: '第6节'
}